/* ====================================================================
   قائمة المنتجات
   عدّل / زِد / احذف منتجات من هنا فقط، الموقع يتحدث تلقائياً
   icon: اختر واحد من: headphones, watch, charger, backpack, sunglasses, lamp
   image: (اختياري) رابط صورة حقيقية، إذا تركتها فارغة "" يظهر أيقونة بسيطة بدلها
==================================================================== */
const PRODUCTS = [
  {
    id: "p1",
    name: ` Lampe Anti-Moustiques Électrique 10W Double Tube UV – مصيدة الباعوض",
    price: 3500,
    description: "منزلك دائماً نظيف من الناموس والذباب! 🏠✨
لا بخاخات سامة، لا فوضى، فقط صاعق كهربائي فعّال وآمن 100%.
🔹 تقنية جذب قوية.
🔹 سهل التعليق والتنظيف.
🔹 مثالي للاستخدام الداخلي.
🛒 اطلب جهازك اليوم وقول وداعاً للحشرات!",
    icon: "antinamous",
    image: "https://share.google/vnuoTWdBhoiLxDsWG"
  },
  {
    id: "p2",
    name: "ساعة ذكية رياضية",
    price: 4500,
    description: "تتبع نشاطك اليومي ونبضات القلب، شاشة لمس واضحة.",
    icon: "watch",
    image: ""
  },
  {
    id: "p3",
    name: "شاحن سريع متعدد المنافذ",
    price: 1800,
    description: "يشحن جهازين في نفس الوقت بسرعة وأمان.",
    icon: "charger",
    image: ""
  },
  {
    id: "p4",
    name: "حقيبة ظهر عصرية",
    price: 2800,
    description: "مساحة واسعة ومريحة، مناسبة للجامعة والعمل والسفر.",
    icon: "backpack",
    image: ""
  },
  {
    id: "p5",
    name: "نظارة شمسية كلاسيك",
    price: 1500,
    description: "حماية كاملة من أشعة الشمس بتصميم أنيق.",
    icon: "sunglasses",
    image: ""
  },
  {
    id: "p6",
    name: "مصباح مكتبي LED",
    price: 2200,
    description: "إضاءة قابلة للتعديل، مريحة للعين، توفر في الكهرباء.",
    icon: "lamp",
    image: ""
  }
];
